<a href="https://colab.research.google.com/github/water-beetle/Python_flearning/blob/master/%2310_%EC%97%AC%EB%A0%A4%EA%B0%9C%EC%9D%98_DataFrame_%ED%95%A9%EC%B9%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Concatenating(연결)**

두 DataFrame이 동일한 index, column을 가지고 있을 때 
하나의 DataFrame에 연속적으로 붙이기

**Merging(병합)**

하나의 열을 기준삼아 해당열의 값이 동일한 두개의 행들을 하나의 행들로 합치는 방법

#Merging

In [0]:
import pandas as pd
import numpy as np

In [0]:
df1 = pd.DataFrame({"key" : list("bbacaab"),
                    "datal" : range(7)})
df2 = pd.DataFrame({"key" : list("abd"),
                    "data2" : range(3)})

In [5]:
df1

  key  datal
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [6]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

*key열을 기준으로 하여 merging*

In [7]:
pd.merge(df1, df2, on = "key")

  key  datal  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [15]:
pd.merge(df1, df2, on="key", how = "inner")

  key  datal  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

DataFrame열의 이름이 다를때 merge

In [19]:
pd.merge(df1, df2, left_on = "key", right_on = "key")

  key  datal  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

index 기준으로 merging

In [0]:
left1 = pd.DataFrame({"key" : ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val' : [3.5,7]}, index = ['a', 'b'])

In [24]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [23]:
right1

   group_val
a        3.5
b        7.0

In [25]:
pd.merge(left1, right1, left_on = "key", right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [30]:
pd.merge(right1, left1, left_index = True, right_on = "key")

   group_val key  value
0        3.5   a      0
2        3.5   a      2
3        3.5   a      3
1        7.0   b      1
4        7.0   b      4

#Concatenating

In [0]:
s1 = pd.Series([0,1], index = ["a", "b"])
s2 = pd.Series([2,3,4], index = ["c", "d", "e"])
s3 = pd.Series([5,6], index = ["f", "g"])

In [32]:
s1

a    0
b    1
dtype: int64

In [33]:
s2

c    2
d    3
e    4
dtype: int64

In [34]:
s3

f    5
g    6
dtype: int64

In [35]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [36]:
pd.concat([s1, s2, s3], axis=1)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [0]:
s4 = pd.concat([s1*5, s3])

In [38]:
pd.concat([s1, s4], axis=1)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [39]:
pd.concat([s1, s2, s3], axis =1, keys = ["one", "two", "three"])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0